{
  "id": 5,
  "status": "-",
  "title": "RAG/Knowledge graph - making the Agents clever",
  "description": "The electron app developed in `src/` has an agentic chat which needs extra features to make the agents clever. References `docs/FILE_ORGANISATION.md`. We want to make them clever by exposing clever local tools for them to use and most importantly that they have scoped knowledge access.",
  "features": [
    {
      "id": "5.1",
      "status": "-",
      "title": "Standard tools",
      "description": "Create a set of standard agent tools that live in a library like code that have documentation that always gets updated whenever there's a new tool added. This document is meant to be passed to an agent so that it knows precisely how to use the tools. The doc needs to be concise and not contain too many descriptions.",
      "context": [],
      "acceptance": []
    },
    {
      "id": "5.2",
      "status": "-",
      "title": "Web search tool",
      "description": "Create at least two versions of web search tools for the agent (for 2 different standard providers).",
      "context": [],
      "acceptance": [],
      "dependencies": [
        "5.1"
      ]
    },
    {
      "id": "5.3",
      "status": "-",
      "title": "Research terminal/code running",
      "description": "There are multiple problems we are facing: 1st the agent makes changes to files, but cannot verify the outcome of its work. We need to provide tools for it so that it would be able to check each new file it makes to see if it compiles. If possible, we should also think of allowing the agent of running the code in some isolated environment. All the options for such a behaviour need to be researched and written into a doc so a decision can be made.",
      "context": [],
      "acceptance": [],
      "dependencies": [
        "5.1"
      ]
    },
    {
      "id": "5.4",
      "status": "-",
      "title": "Hot preview",
      "description": "It would be ideal for an agent to immediately see the effect of their work (preview work tool). So after they change some files, they could request screenshots of how the code/app that they just created renders. This can be based on this project. A methodology needs to be established.",
      "context": [],
      "acceptance": [],
      "dependencies": [
        "5.1"
      ]
    },
    {
      "id": "5.5",
      "status": "-",
      "title": "Context retrieval for chat - using graphiti",
      "description": "There's a library `https://github.com/getzep/graphiti` that provides an upgraded RAG database - a knowledge graph. Create agentic tools for this and allow local-only retrieval.",
      "plan": "",
      "context": [],
      "acceptance": []
    },
    {
      "id": "5.6",
      "status": "-",
      "title": "Areas of knowledge",
      "description": "Assuming we have a knowledge graph in place - the user will want to ask questions about certain 'areas'/'contexts'/'scopes'. Imagine a knowledge graph about finance - it contains information about stocks, companies, cryptocurrencies, commodities etc. The user might want to limit the scope of a context when asking about Bitcoin to just cryptocurrencies - but maybe they want to see how Bitcoin affects the other knowledge or what commonalities it has.",
      "plan": "",
      "context": [],
      "acceptance": [],
      "dependencies": [
        "5.5"
      ]
    }
  ]
}